In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql="SELECT JSON_OBJECT('name',name,'height',height) AS 'JSON값' FROM usertbl WHERE height>=180;"

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

                                0
0  {"name": "임재범", "height": 182}
1  {"name": "이승기", "height": 182}
2  {"name": "성시경", "height": 186}

In [7]:
import pandas as pd
import pymysql

In [8]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [9]:
cur_1=conn1.cursor()

In [10]:
sql='''SET @json='{"usertbl":
	[
		{"name": "임재범", "height": 182},
		{"name": "이승기", "height": 182},
		{"name": "성시경", "height": 186}
	]
}';'''
sql2="SELECT JSON_VALID(@json) AS JSON_VALID;"

In [11]:
cur_1.execute(sql)
cur_1.execute(sql2)
rows_1=cur_1.fetchall()
conn1.close()

In [12]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

   0
0  1

In [13]:
import pandas as pd
import pymysql

In [14]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [15]:
cur_1=conn1.cursor()

In [16]:
sql='''SET @json='{"usertbl":
	[
		{"name": "임재범", "height": 182},
		{"name": "이승기", "height": 182},
		{"name": "성시경", "height": 186}
	]
}';'''
sql2="SELECT JSON_SEARCH(@json,'one','성시경') AS JSON_SEARCH;"

In [17]:
cur_1.execute(sql)
cur_1.execute(sql2)
rows_1=cur_1.fetchall()
conn1.close()

In [18]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

                     0
0  "$.usertbl[2].name"

In [19]:
import pandas as pd
import pymysql

In [20]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [21]:
cur_1=conn1.cursor()

In [22]:
sql='''SET @json='{"usertbl":
	[
		{"name": "임재범", "height": 182},
		{"name": "이승기", "height": 182},
		{"name": "성시경", "height": 186}
	]
}';'''
sql2="SELECT JSON_EXTRACT(@json,'$.usertbl[2].name') AS JSON_EXTRACT;"

In [23]:
cur_1.execute(sql)
cur_1.execute(sql2)
rows_1=cur_1.fetchall()
conn1.close()

In [24]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

       0
0  "성시경"

In [25]:
import pandas as pd
import pymysql

In [26]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [27]:
cur_1=conn1.cursor()

In [28]:
sql='''SET @json='{"usertbl":
	[
		{"name": "임재범", "height": 182},
		{"name": "이승기", "height": 182},
		{"name": "성시경", "height": 186}
	]
}';'''
sql2="SELECT JSON_INSERT(@json,'$.usertbl[0].mDate','2009-09-09') AS JSON_INSERT;"

In [29]:
cur_1.execute(sql)
cur_1.execute(sql2)
rows_1=cur_1.fetchall()
conn1.close()

In [30]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

                                                   0
0  {"usertbl": [{"name": "임재범", "mDate": "2009-09...

In [31]:
import pandas as pd
import pymysql

In [32]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [33]:
cur_1=conn1.cursor()

In [34]:
sql='''SET @json='{"usertbl":
	[
		{"name": "임재범", "height": 182},
		{"name": "이승기", "height": 182},
		{"name": "성시경", "height": 186}
	]
}';'''
sql2="SELECT JSON_REPLACE(@json,'$.usertbl[0].name','홍길동') AS JSON_REPLACE;"

In [35]:
cur_1.execute(sql)
cur_1.execute(sql2)
rows_1=cur_1.fetchall()
conn1.close()

In [36]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

                                                   0
0  {"usertbl": [{"name": "홍길동", "height": 182}, {...

In [37]:
import pandas as pd
import pymysql

In [38]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [39]:
cur_1=conn1.cursor()

In [40]:
sql='''SET @json='{"usertbl":
	[
		{"name": "임재범", "height": 182},
		{"name": "이승기", "height": 182},
		{"name": "성시경", "height": 186}
	]
}';'''
sql2="SELECT JSON_REMOVE(@json,'$.usertbl[0]') AS JSON_REMOVE;"

In [41]:
cur_1.execute(sql)
cur_1.execute(sql2)
rows_1=cur_1.fetchall()
conn1.close()

In [42]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

                                                   0
0  {"usertbl": [{"name": "이승기", "height": 182}, {...